In [1]:
import pandas as pd
import numpy as np

In [2]:
file=r'data/bank-full.csv'

In [6]:
bd=pd.read_csv(file, delimiter=';')
#DELIMITER SPECIFIED FOR READING FILES.

In [7]:
bd.shape

(45211, 17)

In [8]:
bd.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [9]:
bd.describe()

,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [10]:
bd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45211 non-null  int64
 1   job        45211 non-null  object
 2   marital    45211 non-null  object
 3   education  45211 non-null  object
 4   default    45211 non-null  object
 5   balance    45211 non-null  int64
 6   housing    45211 non-null  object
 7   loan       45211 non-null  object
 8   contact    45211 non-null  object
 9   day        45211 non-null  int64
 10  month      45211 non-null  object
 11  duration   45211 non-null  int64
 12  campaign   45211 non-null  int64
 13  pdays      45211 non-null  int64
 14  previous   45211 non-null  int64
 15  poutcome   45211 non-null  object
 16  y          45211 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

In [11]:
bd.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [12]:
bd.nunique()

age            77
job            12
marital         3
education       4
default         2
balance      7168
housing         2
loan            2
contact         3
day            31
month          12
duration     1573
campaign       48
pdays         559
previous       41
poutcome        4
y               2
dtype: int64

In [13]:
bd['age'].describe()

count    45211.000000
mean        40.936210
std         10.618762
min         18.000000
25%         33.000000
50%         39.000000
75%         48.000000
max         95.000000
Name: age, dtype: float64

In [14]:
list(zip(bd.columns,bd.dtypes,bd.nunique()))

[('age', dtype('int64'), 77),
 ('job', dtype('O'), 12),
 ('marital', dtype('O'), 3),
 ('education', dtype('O'), 4),
 ('default', dtype('O'), 2),
 ('balance', dtype('int64'), 7168),
 ('housing', dtype('O'), 2),
 ('loan', dtype('O'), 2),
 ('contact', dtype('O'), 3),
 ('day', dtype('int64'), 31),
 ('month', dtype('O'), 12),
 ('duration', dtype('int64'), 1573),
 ('campaign', dtype('int64'), 48),
 ('pdays', dtype('int64'), 559),
 ('previous', dtype('int64'), 41),
 ('poutcome', dtype('O'), 4),
 ('y', dtype('O'), 2)]

In [15]:
bd['age'].mean(), bd['age'].median()

(40.93621021432837, 39.0)

|Function	|Description|
|-----------|-----------|
|count	|Number of non-null observations|
|sum	|Sum of values|
|mean	|Mean of values|
|mad	|Mean absolute deviation|
|median	|Arithmetic median of values|
|min	|Minimum|
|max	|Maximum|
|mode	|Mode|
|abs	|Absolute Value|
|prod	|Product of values|
|std	|Unbiased standard deviation|
|var	|Unbiased variance|
|sem	|Unbiased standard error of the mean|
|skew	|Unbiased skewness (3rd moment)|
|kurt	|Unbiased kurtosis (4th moment)|
|quantile	|Sample quantile (value at %)|
|cumsum	|Cumulative sum|
|cumprod	|Cumulative product|
|cummax	|Cumulative maximum|
|cummin	|Cumulative minimum|

In [16]:
bd['job'].value_counts()

blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64

In [17]:
bd['job'].value_counts(normalize = True )

blue-collar      0.215257
management       0.209197
technician       0.168034
admin.           0.114375
services         0.091880
retired          0.050076
self-employed    0.034925
entrepreneur     0.032890
unemployed       0.028820
housemaid        0.027427
student          0.020747
unknown          0.006370
Name: job, dtype: float64

In [18]:
bd.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

In [19]:
age=np.random.choice([15,20,30,45,12,'10',7,np.nan],50)

fico=np.random.choice(['100-150','150-200','200-250','250-300'],50)

city=np.random.choice(['Mumbai','Delhi','Chennai','Kolkata'],50)
ID=np.arange(50)
rating=np.random.choice(['Excellent','Good','Bad','Pathetic'],50)
balance=np.random.choice([10000,20000,30000,40000,np.nan,50000,60000],50)
children=np.random.randint(high=5,low=0,size=(50,))

In [20]:
mydata=pd.DataFrame({'ID':ID,'age':age,'fico':fico,'city':city,'rating':rating,'balance':balance,'children':children})
mydata.head()

   ID  age     fico     city     rating  balance  children
0   0   15  200-250  Chennai        Bad  20000.0         4
1   1   15  250-300    Delhi        Bad  60000.0         3
2   2  nan  250-300  Chennai  Excellent  50000.0         4
3   3   12  100-150   Mumbai       Good  10000.0         0
4   4  nan  250-300   Mumbai   Pathetic      NaN         0

In [21]:
mydata.isnull().sum()

ID          0
age         0
fico        0
city        0
rating      0
balance     5
children    0
dtype: int64

In [22]:
mydata['balance'].value_counts()

40000.0    11
50000.0    10
30000.0     8
20000.0     7
10000.0     6
60000.0     3
Name: balance, dtype: int64

In [23]:
print(mydata['balance'].value_counts(normalize=True,dropna =False))
print('................................')
print(mydata['balance'].value_counts(normalize=True,dropna =True))

40000.0    0.22
50000.0    0.20
30000.0    0.16
20000.0    0.14
10000.0    0.12
NaN        0.10
60000.0    0.06
Name: balance, dtype: float64
................................
40000.0    0.244444
50000.0    0.222222
30000.0    0.177778
20000.0    0.155556
10000.0    0.133333
60000.0    0.066667
Name: balance, dtype: float64

In [24]:
help(pd.Series.value_counts)

Help on function value_counts in module pandas.core.base:

value_counts(self, normalize=False, sort=True, ascending=False, bins=None, dropna=True)
    Return a Series containing counts of unique values.

    The resulting object will be in descending order so that the
    first element is the most frequently-occurring element.
    Excludes NA values by default.

    Parameters
    ----------
    normalize : bool, default False
        If True then the object returned will contain the relative
        frequencies of the unique values.
    sort : bool, default True
        Sort by frequencies.
    ascending : bool, default False
        Sort in ascending order.
    bins : int, optional
        Rather than count values, group them into half-open bins,
        a convenience for ``pd.cut``, only works with numeric data.
    dropna : bool, default True
        Don't include counts of NaN.

    Returns
    -------
    Series

    See Also
    --------
    Series.count: Number of non-NA elements in a Series.
    DataFrame.count: Number of non-NA elements in a DataFrame.

    Examples
    --------
    >>> index = pd.Index([3, 1, 2, 3, 4, np.nan])
    >>> index.value_counts()
    3.0    2
    4.0    1
    2.0    1
    1.0    1
    dtype: int64

    With `normalize` set to `True`, returns the relative frequency by
    dividing all values by the sum of values.

    >>> s = pd.Series([3, 1, 2, 3, 4, np.nan])
    >>> s.value_counts(normalize=True)
    3.0    0.4
    4.0    0.2
    2.0    0.2
    1.0    0.2
    dtype: float64

    **bins**

    Bins can be useful for going from a continuous variable to a
    categorical variable; instead of counting unique
    apparitions of values, divide the index in the specified
    number of half-open bins.

    >>> s.value_counts(bins=3)
    (2.0, 3.0]      2
    (0.996, 2.0]    2
    (3.0, 4.0]      1
    dtype: int64

    **dropna**

    With `dropna` set to `False` we can also see NaN index values.

    >>> s.value_counts(dropna=False)
    3.0    2
    NaN    1
    4.0    1
    2.0    1
    1.0    1
    dtype: int64

In [25]:
bd.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [26]:
bd.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [27]:
k=bd['marital'].value_counts()
k

married     27214
single      12790
divorced     5207
Name: marital, dtype: int64

In [28]:
pd.crosstab(bd['default'],bd['housing'])

housing     no    yes
default
no       19701  24695
yes        380    435

In [29]:
pd.crosstab(bd['default'],bd['housing'],margins=True)

housing     no    yes    All
default
no       19701  24695  44396
yes        380    435    815
All      20081  25130  45211

In [31]:
bd.select_dtypes(['object']).head()

,job,marital,education,default,housing,loan,contact,month,poutcome,y
0,management,married,tertiary,no,yes,no,unknown,may,unknown,no
1,technician,single,secondary,no,yes,no,unknown,may,unknown,no
2,entrepreneur,married,secondary,no,yes,yes,unknown,may,unknown,no
3,blue-collar,married,unknown,no,yes,no,unknown,may,unknown,no
4,unknown,single,unknown,no,no,no,unknown,may,unknown,no

In [32]:
cat_var=bd.select_dtypes(['object']).columns
cat_var

Index(['job', 'marital', 'education', 'default', 'housing', 'loan', 'contact',
       'month', 'poutcome', 'y'],
      dtype='object')

In [33]:
for col in cat_var:
    print(bd[col].value_counts())
    print('~~~~~')

blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64
~~~~~
married     27214
single      12790
divorced     5207
Name: marital, dtype: int64
~~~~~
secondary    23202
tertiary     13301
primary       6851
unknown       1857
Name: education, dtype: int64
~~~~~
no     44396
yes      815
Name: default, dtype: int64
~~~~~
yes    25130
no     20081
Name: housing, dtype: int64
~~~~~
no     37967
yes     7244
Name: loan, dtype: int64
~~~~~
cellular     29285
unknown      13020
telephone     2906
Name: contact, dtype: int64
~~~~~
may    13766
jul     6895
aug     6247
jun     5341
nov     3970
apr     2932
feb     2649
jan     1403
oct      738
sep      579
mar      477
dec      214
Name: month, dtype: int64
~~~~~
unknown    36959
failure     4901
other       1840
success     1511
Name: poutcome, dtype: int64
~~~~~
no     39922
yes     5289
Name: y, dtype: int64
~~~~~

In [34]:
bd.groupby('housing').mean()

,age,balance,day,duration,campaign,pdays,previous
housing,,,,,,,
no,43.139883,1596.501270,16.066929,256.700911,2.845625,26.288581,0.484787
yes,39.175288,1175.103064,15.598249,259.331476,2.698488,51.312495,0.656665

In [35]:
bd.groupby(['housing','loan']).mean()

                    age      balance        day    duration  campaign  \
housing loan
no      no    43.260695  1737.606719  16.062427  257.923971  2.823123
        yes   42.417449   752.713243  16.093848  249.387209  2.980188
yes     no    39.142947  1256.407793  15.518711  260.914271  2.690026
        yes   39.329059   788.537898  15.976414  251.806045  2.738722

                  pdays  previous
housing loan
no      no    27.870495  0.510986
        yes   16.828989  0.328120
yes     no    52.231855  0.658094
        yes   46.941379  0.649874

In [36]:
bd.groupby(['housing','default'])['balance','day'].mean()

C:\Users\MansiGupta\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                     balance        day
housing default
no      no       1628.695295  16.043247
        yes       -72.589474  17.294737
yes     no       1199.227374  15.598380
        yes      -194.436782  15.590805

In [37]:
bd.aggregate({'housing':'count','balance':'mean','age':'nunique'})

housing    45211.000000
balance     1362.272058
age           77.000000
dtype: float64